{"name":"Amin Khodabandeh","email":"amin.17@gmail.com","summary":"I started programming with QBasic and soon found this ability on myself that I love to create\nsomething from nothing, so I started to work with other programming languages such as C and\nPascal and later with Delphi and ActionScript.\nI have done many projects with Delphi and SQL-Server for many organisations, thus I have earned\nenough experience in Database projects developing and architecture. Many of these projects still\nare working as well as in their region and subjects. Working on several subjects leads me to learn\nnetworks infrastructures and I get enough experience about Windows Server and Linux.\nSoon I have started to develop web applications with ASP.NET with Visual Basic and C#, MVC\nand Web API, in the parallel side worked with PHP mostly in WordPress and Drupal. JavaScript\nand HTML5 open new horizons that starts my first steps going familiar with JQuery and later with\nAngularJS and I really enjoy during playing with them exactly the time I found Nodejs as a way to use\nJavascript in Back-End development.\nCurrently I manage a dedicated server with Microsoft Hyper-V with two guest machines on it: one\nCentOS and one Microsoft Windows Server. Both serves Web-Application in their fields, In CentOS I\ndevelop and maintenance more than 10 WordPress web sites.\nI've been created two mobile applications by Apache Cordova in both iOS and Android finished by\nAngularJS that served with WordPress Restful.\nMy current project is a web and mobile application building up by ASP.NET, Node.js, and Ionic.","experience":"Senior Software Engineer at Capital Platforms Pte Ltd\nMarch 2015 - Present\n- As a senior software architect my responsibilities are design, develop and implement applications\nwith most recent technologies and make them to be stable and applicable for our customers.\n- As a senior software developer, I create applications by using most recent technologies such as\nASP.NET MVC and WebApi, AngularJS, RESTFUL, SQL-Server, HTML5.\n- As a mentor for our teammates and colleagues to help and lead them.\n- Develop and support web software and enterprise applications in the finance and online trading\nfollowing range of products - Stand Alone investments, Insurance Linked Platforms, QROPS,\nQNUPS, regular premium and general insurance products.\nSenior Software Developer at Capital Platforms Pte Ltd\nPage 2\nOctober 2014 - Present\nDevelop and support web software and enterprise application for customers,","education":"Azad University (IAU)\nBachelor's degree, Computer Software Engineering, 2003 - 2005\nUCNA\nBS, Computer Software Engineering, 2000 - 2002\nPage 3\nAmin Khodabandeh\nSenior Software Architect at Capital Platforms Pte. Ltd.\namin.17@gmail.com\nContact Amin on LinkedIn"}